МП/src/InformationRegisters/Напоминания/Напоминания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Напоминания</name>
  <resources>
    <name>ДатаНапоминания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ВремяНапоминания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзначальнаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ЭлементыДоски</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МП/src/CommonModules/ОбщийВызовСервера/Module.bsl
функция ПолучитьНапоминанияСервер() Экспорт//Ден  2016 10 11 ---
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Напоминания.ДатаНапоминания КАК ДатаНапоминания,
	|	Напоминания.Элемент КАК Элемент,
	|	Напоминания.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.Напоминания КАК Напоминания
	|ГДЕ
	|	Напоминания.ДатаНапоминания >= &ДатаНапоминания";	
	Запрос.УстановитьПараметр("ДатаНапоминания", ТекущаяДата());	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	массивВозврата = новый Массив;
	
	Пока РезультатЗапроса.Следующий() Цикл
		массивВозврата.Добавить(новый Структура("ДатаНапоминания,Элемент,Комментарий",РезультатЗапроса.ДатаНапоминания,РезультатЗапроса.Элемент,РезультатЗапроса.Комментарий));
	КонецЦикла;
	
	возврат массивВозврата;
	
КонецФункции

функция ПроверитьНапоминанияСервер() Экспорт//Ден  2016 10 11 --- 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Напоминания.ДатаНапоминания КАК ДатаНапоминания
	|ИЗ
	|	РегистрСведений.Напоминания КАК Напоминания
	|ГДЕ
	|	Напоминания.ДатаНапоминания < &ДатаНапоминания
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНапоминания УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаНапоминания", ТекущаяДата()-константы.МинутОтсрочкиПовторногоНапоминания.Получить()*60);
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаЗапроса.Следующий() Тогда
		возврат истина;
	иначе
		возврат ложь;
	КонецЕсли;
	
КонецФункции

функция ПолучитьЗначениеКонстанты(Константа) Экспорт//Ден  2016 10 11 --- 
	возврат константы[Константа].Получить();
КонецФункции

процедура ЗаписатьНовоеЗначениеКонстанты(Константа,Значение) Экспорт//Ден  2016 10 11 --- 
	константы[Константа].Установить(Значение);
КонецПроцедуры
